#!/usr/bin/env python3
# -*- coding: utf-8 -*-

"""
学校管理员
"""

__author__ = 'Cliff Wang'

from schoolMember import SchoolMember
from school import School

class Manager(SchoolMember):

    def __init__(self, school):
        super().__init__(school)
        self.menu = {
            "1":"创建学校",
            "2":"登录学校",
            "21":"管理员管理",
            "211":"查看管理员列表",
            "212":"新增管理员",
            "213":"修改管理员",
            "214":"删除管理员",
            "210":"退出管理员管理",
            "22":"课程管理",
            "221":"查看课程列表",
            "222":"新增课程",
            "223":"修改课程",
            "224":"删除课程",
            "220":"退出课程管理",
            "23":"班级管理",
            "231":"查看班级列表",
            "232":"新增班级",
            "233":"修改班级",
            "234":"删除班级",
            "230":"退出班级管理",
            "24":"老师管理",
            "241":"查看老师列表",
            "242":"招聘老师",
            "243":"修改管理员",
            "244":"删除老师",
            "240":"退出老师管理",
            "25":"学生管理",
            "251":"查看学生列表",
            "254":"开出学生",
            "250":"退出学生管理",
            "26":"修改密码",
            "20":"退出登录",
            "0":"退出"
        }
        self.schoolID = ""
        self.status = True

if __name__ == "__main__":
    school = School("深圳分校", "南山科技园001号", "0755-12348888")
    ma = Manager(school)
    ma.printMenu("请选择管理项目：", "111")
